print ('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .')

w1 = input('покрытая … - ')
c1 = input('кожиц..й - ')[0]
w2 = input('держитс на … - ')
c2 = input('ножк.. - ')[0]
w3 = input('затянута … - ')
w4 = input('нижняя … - ')
c3 = input('шляпк.. - ')[0]

print ('Шляпка гриба, покрытая ' + w1 + ' кожиц'+c1+'й, держится на ' + w2 + ' ножк'+c2+' . Снизу шляпка затянута ' + w3 + ' плёнкой. Когда её уберёшь, откроется нижняя ' + w4 + ' сторона шляпк'+c3+ '.')